# Задача 4: Кортежи
# Задача: Создайте кортеж из трех элементов и выведите его длину.
# Решение:
# python
# my_tuple = (1, 2, 3)
# print(len(my_tuple))
# kortej1 = ("as", "va", "c", "s", "a")
# lortej2 = (1, 2, 3, 4, 5, 6)
# kortej1lortez = zip(kortej1, lortej2)
# combtuple = tuple(kortej1lortez)
# print(combtuple)
# Дополнительные задачи:
# Создайте кортеж из строковых значений и выведите первый элемент.
# Попробуйте изменить один из элементов кортежа (что произойдет?). ошибка
# Объедините два кортежа в один.
