# Задача 4: Кортежи
# Задача: Создайте кортеж из трех элементов и выведите его длину.
# Решение:
# python
my_tuple = (1, 2, 3)
print(len(my_tuple))


# Дополнительные задачи:
# Создайте кортеж из строковых значений и выведите первый элемент.
# Попробуйте изменить один из элементов кортежа (что произойдет?).
# Объедините два кортежа в один.
